espressif/esp-idf/components/soc/esp32h21/register/soc/pvt_reg.h
/** PVT_COMB_PD_SITE0_UNIT0_VT1_CONF1_REG register
 *  needs desc
 */
#define PVT_COMB_PD_SITE0_UNIT0_VT1_CONF1_REG (DR_REG_PVT_BASE + 0x78)
/** PVT_MONITOR_EN_VT1_PD_SITE0_UNIT0 : R/W; bitpos: [0]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_EN_VT1_PD_SITE0_UNIT0    (BIT(0))
#define PVT_MONITOR_EN_VT1_PD_SITE0_UNIT0_M  (PVT_MONITOR_EN_VT1_PD_SITE0_UNIT0_V << PVT_MONITOR_EN_VT1_PD_SITE0_UNIT0_S)
#define PVT_MONITOR_EN_VT1_PD_SITE0_UNIT0_V  0x00000001U
#define PVT_MONITOR_EN_VT1_PD_SITE0_UNIT0_S  0
/** PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT0 : WT; bitpos: [1]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT0    (BIT(1))
#define PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT0_M  (PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT0_V << PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT0_S)
#define PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT0_V  0x00000001U
#define PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT0_S  1
/** PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT0 : R/W; bitpos: [9:2]; default: 20;
 *  needs field desc
 */
#define PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT0    0x000000FFU
#define PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT0_M  (PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT0_V << PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT0_S)
#define PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT0_V  0x000000FFU
#define PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT0_S  2
/** PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT0 : RO; bitpos: [30:23]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT0    0x000000FFU
#define PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT0_M  (PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT0_V << PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT0_S)
#define PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT0_V  0x000000FFU
#define PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT0_S  23
/** PVT_TIMING_ERR_VT1_PD_SITE0_UNIT0 : RO; bitpos: [31]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_VT1_PD_SITE0_UNIT0    (BIT(31))
#define PVT_TIMING_ERR_VT1_PD_SITE0_UNIT0_M  (PVT_TIMING_ERR_VT1_PD_SITE0_UNIT0_V << PVT_TIMING_ERR_VT1_PD_SITE0_UNIT0_S)
#define PVT_TIMING_ERR_VT1_PD_SITE0_UNIT0_V  0x00000001U
#define PVT_TIMING_ERR_VT1_PD_SITE0_UNIT0_S  31

/** PVT_COMB_PD_SITE0_UNIT1_VT1_CONF1_REG register
 *  needs desc
 */
#define PVT_COMB_PD_SITE0_UNIT1_VT1_CONF1_REG (DR_REG_PVT_BASE + 0x7c)
/** PVT_MONITOR_EN_VT1_PD_SITE0_UNIT1 : R/W; bitpos: [0]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_EN_VT1_PD_SITE0_UNIT1    (BIT(0))
#define PVT_MONITOR_EN_VT1_PD_SITE0_UNIT1_M  (PVT_MONITOR_EN_VT1_PD_SITE0_UNIT1_V << PVT_MONITOR_EN_VT1_PD_SITE0_UNIT1_S)
#define PVT_MONITOR_EN_VT1_PD_SITE0_UNIT1_V  0x00000001U
#define PVT_MONITOR_EN_VT1_PD_SITE0_UNIT1_S  0
/** PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT1 : WT; bitpos: [1]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT1    (BIT(1))
#define PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT1_M  (PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT1_V << PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT1_S)
#define PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT1_V  0x00000001U
#define PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT1_S  1
/** PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT1 : R/W; bitpos: [9:2]; default: 20;
 *  needs field desc
 */
#define PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT1    0x000000FFU
#define PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT1_M  (PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT1_V << PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT1_S)
#define PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT1_V  0x000000FFU
#define PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT1_S  2
/** PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT1 : RO; bitpos: [30:23]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT1    0x000000FFU
#define PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT1_M  (PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT1_V << PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT1_S)
#define PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT1_V  0x000000FFU
#define PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT1_S  23
/** PVT_TIMING_ERR_VT1_PD_SITE0_UNIT1 : RO; bitpos: [31]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_VT1_PD_SITE0_UNIT1    (BIT(31))
#define PVT_TIMING_ERR_VT1_PD_SITE0_UNIT1_M  (PVT_TIMING_ERR_VT1_PD_SITE0_UNIT1_V << PVT_TIMING_ERR_VT1_PD_SITE0_UNIT1_S)
#define PVT_TIMING_ERR_VT1_PD_SITE0_UNIT1_V  0x00000001U
#define PVT_TIMING_ERR_VT1_PD_SITE0_UNIT1_S  31

/** PVT_COMB_PD_SITE0_UNIT2_VT1_CONF1_REG register
 *  needs desc
 */
#define PVT_COMB_PD_SITE0_UNIT2_VT1_CONF1_REG (DR_REG_PVT_BASE + 0x80)
/** PVT_MONITOR_EN_VT1_PD_SITE0_UNIT2 : R/W; bitpos: [0]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_EN_VT1_PD_SITE0_UNIT2    (BIT(0))
#define PVT_MONITOR_EN_VT1_PD_SITE0_UNIT2_M  (PVT_MONITOR_EN_VT1_PD_SITE0_UNIT2_V << PVT_MONITOR_EN_VT1_PD_SITE0_UNIT2_S)
#define PVT_MONITOR_EN_VT1_PD_SITE0_UNIT2_V  0x00000001U
#define PVT_MONITOR_EN_VT1_PD_SITE0_UNIT2_S  0
/** PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT2 : WT; bitpos: [1]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT2    (BIT(1))
#define PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT2_M  (PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT2_V << PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT2_S)
#define PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT2_V  0x00000001U
#define PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT2_S  1
/** PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT2 : R/W; bitpos: [9:2]; default: 20;
 *  needs field desc
 */
#define PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT2    0x000000FFU
#define PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT2_M  (PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT2_V << PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT2_S)
#define PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT2_V  0x000000FFU
#define PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT2_S  2
/** PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT2 : RO; bitpos: [30:23]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT2    0x000000FFU
#define PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT2_M  (PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT2_V << PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT2_S)
#define PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT2_V  0x000000FFU
#define PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT2_S  23
/** PVT_TIMING_ERR_VT1_PD_SITE0_UNIT2 : RO; bitpos: [31]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_VT1_PD_SITE0_UNIT2    (BIT(31))
#define PVT_TIMING_ERR_VT1_PD_SITE0_UNIT2_M  (PVT_TIMING_ERR_VT1_PD_SITE0_UNIT2_V << PVT_TIMING_ERR_VT1_PD_SITE0_UNIT2_S)
#define PVT_TIMING_ERR_VT1_PD_SITE0_UNIT2_V  0x00000001U
#define PVT_TIMING_ERR_VT1_PD_SITE0_UNIT2_S  31

